zengwangfa/Underwater-Vehicle/software/18.8.21最终)/Chip/inc/kinetis/MK40DZ10.h
/* FB - Register array accessors */
#define FB_CSAR(index)                           FB_CSAR_REG(FB_BASE_PTR,index)
#define FB_CSMR(index)                           FB_CSMR_REG(FB_BASE_PTR,index)
#define FB_CSCR(index)                           FB_CSCR_REG(FB_BASE_PTR,index)

/**
 * @}
 */ /* end of group FB_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group FB_Peripheral */


/*
** End of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/**
 * @}
 */ /* end of group Peripheral_defines */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define FB_CSCR_EXALE_MASK                       FB_CSCR_EXTS_MASK
#define FB_CSCR_EXALE_SHIFT                      FB_CSCR_EXTS_SHIFT
#define RTC_CCR_REG                              This_symb_has_been_deprecated
#define RTC_CCR_CONFIG_MASK                      This_symb_has_been_deprecated
#define RTC_CCR_CONFIG_SHIFT                     This_symb_has_been_deprecated
#define RTC_CCR_CONFIG                           This_symb_has_been_deprecated
#define RTC_WAR_CCRW_MASK                        This_symb_has_been_deprecated
#define RTC_WAR_CCRW_SHIFT                       This_symb_has_been_deprecated
#define RTC_RAR_CCRR_MASK                        This_symb_has_been_deprecated
#define RTC_RAR_CCRR_SHIFT                       This_symb_has_been_deprecated
#define RTC_CCR                                  This_symb_has_been_deprecated
#define SIM_FCFG1_FSIZE_MASK                     This_symb_has_been_deprecated
#define SIM_FCFG1_FSIZE_SHIFT                    This_symb_has_been_deprecated
#define SIM_FCFG1_FSIZE                          This_symb_has_been_deprecated
#define I2S_CR_SSIEN_MASK                        I2S_CR_I2SEN_MASK
#define I2S_CR_SSIEN_SHIFT                       I2S_CR_I2SEN_SHIFT
#define SDHC_VENDOR_VOLTSEL_MASK                 This_symb_has_been_deprecated
#define SDHC_VENDOR_VOLTSEL_SHIFT                This_symb_has_been_deprecated
#define INT_Reserved4                            INT_Mem_Manage_Fault
#define TSI_CNTR1_CNTN_MASK                      TSI_CNTR1_CTN1_MASK
#define TSI_CNTR1_CNTN_SHIFT                     TSI_CNTR1_CTN1_SHIFT
#define TSI_CNTR1_CNTN(x)                        TSI_CNTR1_CTN1(x)
#define TSI_CNTR1_CNTN1_MASK                     TSI_CNTR1_CTN_MASK
#define TSI_CNTR1_CNTN1_SHIFT                    TSI_CNTR1_CTN_SHIFT
#define TSI_CNTR1_CNTN1(x)                       TSI_CNTR1_CTN(x)
#define TSI_CNTR3_CNTN_MASK                      TSI_CNTR3_CTN1_MASK
#define TSI_CNTR3_CNTN_SHIFT                     TSI_CNTR3_CTN1_SHIFT
#define TSI_CNTR3_CNTN(x)                        TSI_CNTR3_CTN1(x)
#define TSI_CNTR3_CNTN1_MASK                     TSI_CNTR3_CTN_MASK
#define TSI_CNTR3_CNTN1_SHIFT                    TSI_CNTR3_CTN_SHIFT
#define TSI_CNTR3_CNTN1(x)                       TSI_CNTR3_CTN(x)
#define TSI_CNTR5_CNTN_MASK                      TSI_CNTR5_CTN1_MASK
#define TSI_CNTR5_CNTN_SHIFT                     TSI_CNTR5_CTN1_SHIFT
#define TSI_CNTR5_CNTN(x)                        TSI_CNTR5_CTN1(x)
#define TSI_CNTR5_CNTN1_MASK                     TSI_CNTR5_CTN_MASK
#define TSI_CNTR5_CNTN1_SHIFT                    TSI_CNTR5_CTN_SHIFT
#define TSI_CNTR5_CNTN1(x)                       TSI_CNTR5_CTN(x)
#define TSI_CNTR7_CNTN_MASK                      TSI_CNTR7_CTN1_MASK
#define TSI_CNTR7_CNTN_SHIFT                     TSI_CNTR7_CTN1_SHIFT
#define TSI_CNTR7_CNTN(x)                        TSI_CNTR7_CTN1(x)
#define TSI_CNTR7_CNTN1_MASK                     TSI_CNTR7_CTN_MASK
#define TSI_CNTR7_CNTN1_SHIFT                    TSI_CNTR7_CTN_SHIFT
#define TSI_CNTR7_CNTN1(x)                       TSI_CNTR7_CTN(x)
#define TSI_CNTR9_CNTN_MASK                      TSI_CNTR9_CTN1_MASK
#define TSI_CNTR9_CNTN_SHIFT                     TSI_CNTR9_CTN1_SHIFT
#define TSI_CNTR9_CNTN(x)                        TSI_CNTR9_CTN1(x)
#define TSI_CNTR9_CNTN1_MASK                     TSI_CNTR9_CTN_MASK
#define TSI_CNTR9_CNTN1_SHIFT                    TSI_CNTR9_CTN_SHIFT
#define TSI_CNTR9_CNTN1(x)                       TSI_CNTR9_CTN(x)
#define TSI_CNTR11_CNTN_MASK                     TSI_CNTR11_CTN1_MASK
#define TSI_CNTR11_CNTN_SHIFT                    TSI_CNTR11_CTN1_SHIFT
#define TSI_CNTR11_CNTN(x)                       TSI_CNTR11_CTN1(x)
#define TSI_CNTR11_CNTN1_MASK                    TSI_CNTR11_CTN_MASK
#define TSI_CNTR11_CNTN1_SHIFT                   TSI_CNTR11_CTN_SHIFT
#define TSI_CNTR11_CNTN1(x)                      TSI_CNTR11_CTN(x)
#define TSI_CNTR13_CNTN_MASK                     TSI_CNTR13_CTN1_MASK
#define TSI_CNTR13_CNTN_SHIFT                    TSI_CNTR13_CTN1_SHIFT
#define TSI_CNTR13_CNTN(x)                       TSI_CNTR13_CTN1(x)
#define TSI_CNTR13_CNTN1_MASK                    TSI_CNTR13_CTN_MASK
#define TSI_CNTR13_CNTN1_SHIFT                   TSI_CNTR13_CTN_SHIFT
#define TSI_CNTR13_CNTN1(x)                      TSI_CNTR13_CTN(x)
#define TSI_CNTR15_CNTN_MASK                     TSI_CNTR15_CTN1_MASK
#define TSI_CNTR15_CNTN_SHIFT                    TSI_CNTR15_CTN1_SHIFT
#define TSI_CNTR15_CNTN(x)                       TSI_CNTR15_CTN1(x)
#define TSI_CNTR15_CNTN1_MASK                    TSI_CNTR15_CTN_MASK
#define TSI_CNTR15_CNTN1_SHIFT                   TSI_CNTR15_CTN_SHIFT
#define TSI_CNTR15_CNTN1(x)                      TSI_CNTR15_CTN(x)

/**
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MCU_MK40DZ10) && !defined(MCU_MK40X256VMD100) */
  /* There is already included the same memory map. Check if it is the same version */
  #if (MCU_MEM_MAP_VERSION != 0x0101u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two different versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0101u) */
#endif  /* #if !defined(MCU_MK40DZ10) && !defined(MCU_MK40X256VMD100) */

/* MK40DZ10.h, eof. */
